---
type: LoadBase
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 14
tags: [revit-api, class]
---

# LoadBase

`Autodesk.Revit.DB.Structure.LoadBase` · Revit 2024 · 14 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsOrientToPermitted | 2015 | `public bool IsOrientToPermitted ( LoadOrientTo orientTo )` |
| Method | RemoveHostConstraint | — | `public void RemoveHostConstraint ()` |
| Property | HostElementId | 2015 | `public ElementId HostElementId { get ; }` |
| Property | IsConstrainedOnHost | — | `public bool IsConstrainedOnHost { get ; }` |
| Property | IsHosted | 2016 | `public bool IsHosted { get ; }` |
| Property | IsReaction | 2016 | `public bool IsReaction { get ; set ; }` |
| Property | LoadCase | 2016 | `public LoadCase LoadCase { get ; }` |
| Property | LoadCaseId | — | `public ElementId LoadCaseId { get ; set ; }` |
| Property | LoadCaseName | — | `public string LoadCaseName { get ; }` |
| Property | LoadCategoryName | — | `public string LoadCategoryName { get ; }` |
| Property | LoadNatureName | — | `public string LoadNatureName { get ; }` |
| Property | OrientTo | 2015 | `public LoadOrientTo OrientTo { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | WorkPlaneId | 2015 | `public ElementId WorkPlaneId { get ; }` |